tutorials/incompressibleVoF/floatingObjectWaves/system/subsetMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      subsetMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

zone
{
    type        box;
    select      outside;
    box         (0.35 0.35 0.1) (0.65 0.55 0.6);
}

patch   floatingObject;

// ************************************************************************* //
